devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        struct spi_virtual *hdl    = device_handle;

        int status = _sys_mutex_lock(SPIM->device_protect_mtx[hdl->major], MUTEX_TIMOUT);
        if (status == ESUCC) {
                if (SPIM->RAW[hdl->major] == false) {
                        deselect_slave(hdl->major);
                        apply_SPI_config(hdl);
                        select_slave(hdl->major, hdl->minor);
                }

                status = transceive(hdl, NULL, dst, count);
                if (status == ESUCC) {
                        *rdcnt = count;
                }

                _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
        }

        return status;
}

//==============================================================================
/**
 * @brief IO control.  Function does not check that current task is
 *        allowed to write. This is filtered by the open() function. This design
 *        helps to handle other modules that uses directly files to transfer
 *        data. This allows modules to access file from other tasks
 *        (application tasks that not opened SPI file).
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(SPI, void *device_handle, int request, void *arg)
{
        struct spi_virtual *hdl    = device_handle;
        int                 status = EIO;

        switch (request) {
        case IOCTL_SPI__SET_CONFIGURATION:
                if (arg) {
                        hdl->config = *reinterpret_cast(struct SPI_config*, arg);
                        status      = ESUCC;
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_SPI__GET_CONFIGURATION:
                if (arg) {
                        *reinterpret_cast(struct SPI_config*, arg) = hdl->config;
                        status = ESUCC;
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_SPI__SELECT:
                if (_sys_mutex_trylock(SPIM->device_protect_mtx[hdl->major]) == ESUCC) {
                        SPIM->RAW[hdl->major] = true;
                        apply_SPI_config(hdl);
                        deselect_slave(hdl->major);
                        select_slave(hdl->major, hdl->minor);
                        status = ESUCC;
                } else {
                        status = EBUSY;
                }
                break;

        case IOCTL_SPI__DESELECT:
                if (_sys_mutex_trylock(SPIM->device_protect_mtx[hdl->major]) == ESUCC) {
                        deselect_slave(hdl->major);
                        apply_SPI_safe_config(hdl->major);
                        SPIM->RAW[hdl->major] = false;
                        _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
                        _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
                        status = ESUCC;
                } else {
                        status = EBUSY;
                }
                break;

        case IOCTL_SPI__TRANSCEIVE:
                if (arg) {
                        struct SPI_transceive *tr = reinterpret_cast(struct SPI_transceive*, arg);

                        if (tr->count) {
                                if (_sys_mutex_trylock(SPIM->device_protect_mtx[hdl->major]) == ESUCC) {
                                        if (SPIM->RAW[hdl->major] == false) {
                                                deselect_slave(hdl->major);
                                                apply_SPI_config(hdl);
                                                select_slave(hdl->major, hdl->minor);
                                        }

                                        status = transceive(hdl, tr->tx_buffer, tr->rx_buffer, tr->count);

                                        _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
                                }
                        } else {
                                status = EINVAL;
                        }
                } else {
                        status = EINVAL;
                }
                break;

        case IOCTL_SPI__TRANSMIT_NO_SELECT:
                if (arg) {
                        int byte = reinterpret_cast(int, arg);

                        if (_sys_mutex_trylock(SPIM->device_protect_mtx[hdl->major]) == ESUCC) {
                                deselect_slave(hdl->major);
                                apply_SPI_config(hdl);

                                if (transceive(hdl, static_cast(u8_t*, &byte), NULL, 1)) {
                                        status = ESUCC;
                                }

                                _sys_mutex_unlock(SPIM->device_protect_mtx[hdl->major]);
                        }
                } else {
                        status = EINVAL;
                }
                break;

        default:
                status = EBADRQC;
                break;
        }

        return status;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(SPI, void *device_handle)
{
        UNUSED_ARG(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(SPI, void *device_handle, struct vfs_dev_stat *device_stat)
{
        struct spi_virtual *hdl = device_handle;

        device_stat->st_major = hdl->major;
        device_stat->st_minor = hdl->minor;
        device_stat->st_size  = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function enable SPI interface
 * @param[in] major     SPI major number
 * @return One of errno value.
 */
//==============================================================================
static int turn_on_SPI(u8_t major)
{
        if (!(*SPI_cfg[major].APBENR & SPI_cfg[major].APBRSTRENR_mask)) {
                *SPI_cfg[major].APBRSTR |=  SPI_cfg[major].APBRSTRENR_mask;
                *SPI_cfg[major].APBRSTR &= ~SPI_cfg[major].APBRSTRENR_mask;
                *SPI_cfg[major].APBENR  |=  SPI_cfg[major].APBRSTRENR_mask;
                return ESUCC;
        } else {
                return EADDRINUSE;
        }
}

//==============================================================================
/**
 * @brief Function disable SPI interface
 * @param[in] major     SPI major number
 * @return None
 */
//==============================================================================
static void turn_off_SPI(u8_t major)
{
        *SPI_cfg[major].APBRSTR |=  SPI_cfg[major].APBRSTRENR_mask;
        *SPI_cfg[major].APBRSTR &= ~SPI_cfg[major].APBRSTRENR_mask;
        *SPI_cfg[major].APBENR  &= ~SPI_cfg[major].APBRSTRENR_mask;
}

//==============================================================================
/**
 * @brief Function apply new configuration for selected SPI
 *
 * @param vspi          virtual spi handler
 */
//==============================================================================
static void apply_SPI_config(struct spi_virtual *vspi)
{
        const u16_t divider_mask[SPI_CLK_DIV_256 + 1] = {
                [SPI_CLK_DIV_2  ] = 0x00,
                [SPI_CLK_DIV_4  ] = SPI_CR1_BR_0,
                [SPI_CLK_DIV_8  ] = SPI_CR1_BR_1,
                [SPI_CLK_DIV_16 ] = SPI_CR1_BR_1 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_32 ] = SPI_CR1_BR_2,
                [SPI_CLK_DIV_64 ] = SPI_CR1_BR_2 | SPI_CR1_BR_0,
                [SPI_CLK_DIV_128] = SPI_CR1_BR_2 | SPI_CR1_BR_1,
                [SPI_CLK_DIV_256] = SPI_CR1_BR_2 | SPI_CR1_BR_1 | SPI_CR1_BR_0,
        };

        const u16_t spi_mode_mask[SPI_MODE_3 + 1] = {
                [SPI_MODE_0] = 0x00,
                [SPI_MODE_1] = SPI_CR1_CPHA,
                [SPI_MODE_2] = SPI_CR1_CPOL,
                [SPI_MODE_3] = SPI_CR1_CPOL | SPI_CR1_CPHA
        };

        SPI_t *SPI = SPI_cfg[vspi->major].SPI;

        /* configure SPI divider */
        CLEAR_BIT(SPI->CR1, SPI_CR1_BR);
        SET_BIT(SPI->CR1, divider_mask[vspi->config.clk_divider]);

        /* configure SPI mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_CPOL | SPI_CR1_CPHA);
        SET_BIT(SPI->CR1, spi_mode_mask[vspi->config.mode]);

        /* 8-bit mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_DFF);

        /* set MSB/LSB */
        if (vspi->config.msb_first)
                CLEAR_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        else
                SET_BIT(SPI->CR1, SPI_CR1_LSBFIRST);

        /* NSS software mode */
        SET_BIT(SPI->CR1, SPI_CR1_SSM | SPI_CR1_SSI);

        /* set SPI as master */
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);

