devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        /* enable peripheral */
        SET_BIT(SPI->CR1, SPI_CR1_SPE);
}

//==============================================================================
/**
 * @brief Function apply SPI device safe configuration
 *
 * @param major         SPI major number
 */
//==============================================================================
static void apply_SPI_safe_config(u8_t major)
{
        SPI_t *SPI = SPI_cfg[major].SPI;

        while (SPI->SR & SPI_SR_BSY)
        CLEAR_BIT(SPI->CR1, SPI_CR1_SPE);
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);
}

//==============================================================================
/**
 * @brief Function select slave device
 *
 * @param major         major device number (SPI device)
 * @param minor         minor device number (CS number)
 */
//==============================================================================
static void select_slave(u8_t major, u8_t minor)
{
        GPIO_t *GPIO = SPI_cfg[major].CS[minor].port;
        u16_t   mask = SPI_cfg[major].CS[minor].pin_mask;

        if (GPIO) {
                GPIO->BRR = mask;
        }
}

//==============================================================================
/**
 * @brief Function deselect current slave device
 *
 * @param major         major device number (SPI device)
 * @param minor         minor device number (CS number)
 */
//==============================================================================
static void deselect_slave(u8_t major)
{
        for (int minor = 0; minor < SPI_cfg[major].number_of_slaves; minor++) {
                GPIO_t *GPIO = SPI_cfg[major].CS[minor].port;
                u16_t   mask = SPI_cfg[major].CS[minor].pin_mask;

                if (GPIO) {
                        GPIO->BSRR = mask;
                }
        }
}

//==============================================================================
/**
 * @brief  Transceive data by using IRQs or DMA
 * @param  hdl          virtual SPI handler
 * @param  tx           source buffer
 * @param  rx           destination buffer
 * @param  count        number of bytes to transfer
 * @return One of errno value
 */
//==============================================================================
static int transceive(struct spi_virtual *hdl, const u8_t *tx, u8_t *rx, size_t count)
{
        if (SPI_cfg[hdl->major].DMA) {
                #if  (_SPI1_USE_DMA > 0) || (_SPI2_USE_DMA > 0) || (_SPI3_USE_DMA > 0)
                SPIM->dummy_byte[hdl->major] = hdl->config.dummy_byte;
                SPIM->count[hdl->major]      = count;

                SPI_cfg[hdl->major].DMA_Tx_channel->CPAR  = reinterpret_cast(u32_t, &SPI_cfg[hdl->major].SPI->DR);
                SPI_cfg[hdl->major].DMA_Tx_channel->CMAR  = tx ? reinterpret_cast(u32_t, tx) : reinterpret_cast(u32_t, &SPIM->dummy_byte[hdl->major]);
                SPI_cfg[hdl->major].DMA_Tx_channel->CNDTR = count;
                SPI_cfg[hdl->major].DMA_Tx_channel->CCR   = (tx ? DMA_CCR1_MINC : 0) | DMA_CCR1_DIR;

                SPI_cfg[hdl->major].DMA_Rx_channel->CPAR  = reinterpret_cast(u32_t, &SPI_cfg[hdl->major].SPI->DR);
                SPI_cfg[hdl->major].DMA_Rx_channel->CMAR  = rx ? reinterpret_cast(u32_t, rx) : reinterpret_cast(u32_t, &SPIM->dummy_byte[hdl->major]);
                SPI_cfg[hdl->major].DMA_Rx_channel->CNDTR = count;
                SPI_cfg[hdl->major].DMA_Rx_channel->CCR   = (rx ? DMA_CCR1_MINC : 0) | DMA_CCR1_TEIE | DMA_CCR1_TCIE;

                SET_BIT(SPI_cfg[hdl->major].SPI->CR2, SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);
                SET_BIT(SPI_cfg[hdl->major].DMA_Rx_channel->CCR, DMA_CCR1_EN);
                SET_BIT(SPI_cfg[hdl->major].DMA_Tx_channel->CCR, DMA_CCR1_EN);
                #endif
        } else {
                #if (_SPI1_USE_DMA == 0 && _SPI1_ENABLE) || (_SPI2_USE_DMA == 0 && _SPI2_ENABLE) || (_SPI3_USE_DMA == 0 && _SPI3_ENABLE)
                SPIM->tx_buffer[hdl->major]  = tx;
                SPIM->rx_buffer[hdl->major]  = rx;
                SPIM->count[hdl->major]      = count;
                SPIM->dummy_byte[hdl->major] = hdl->config.dummy_byte;

                SET_BIT(SPI_cfg[hdl->major].SPI->CR2, SPI_CR2_TXEIE);
                #endif
        }

        return _sys_semaphore_wait(SPIM->wait_irq_sem[hdl->major], SEMAPHORE_TIMEOUT);
}

//==============================================================================
/**
 * @brief  Function handle SPI IRQ
 * @param  major        SPI device number
 * @return If task was woken then true is returned, otherwise false
 */
//==============================================================================
#if (_SPI1_USE_DMA == 0 && _SPI1_ENABLE) || (_SPI2_USE_DMA == 0 && _SPI2_ENABLE) || (_SPI3_USE_DMA == 0 && _SPI3_ENABLE)
static bool handle_SPI_IRQ(u8_t major)
{
        bool woken = false;
        SPI_t *SPI = SPI_cfg[major].SPI;

        /* receive data from RX register */
        void receive()
        {
                if ((SPI->SR & SPI_SR_RXNE) && (SPI->CR2 & SPI_CR2_RXNEIE)) {
                        u8_t byte = SPI->DR;

                        if (SPIM->count[major] > 0) {
                                if (SPIM->rx_buffer[major]) {
                                        *(SPIM->rx_buffer[major]++) = byte;
                                }

                                SPIM->count[major]--;
                        }

                        SET_BIT(SPI->CR2, SPI_CR2_TXEIE);
                }
        }

        /* transmit data by using Tx register */
        void transmit()
        {
                if ((SPI->SR & SPI_SR_TXE) && (SPI->CR2 & SPI_CR2_TXEIE)) {

                        if (SPIM->count[major] > 0) {
                                if (SPIM->tx_buffer[major]) {
                                        SPI->DR = *(SPIM->tx_buffer[major]++);
                                } else {
                                        SPI->DR = SPIM->dummy_byte[major];
                                }
                        }

                        SET_BIT(SPI->CR2, SPI_CR2_RXNEIE);
                        CLEAR_BIT(SPI->CR2, SPI_CR2_TXEIE);
                }
        }

